comsys/as.html
---
layout: page
title: Autonome Systeme
---

<p>
Ein <b>Autonomes System</b> (AS) ist eine Gruppe von IP Netzen, die gemeinsam
verwaltet werden. AS sind untereinander verbunden und bilden so das
Internet. AS werden über eine 16-Bit (RFC1930) oder eine 32-Bit Zahl
(RFC6996) identifiziert, welche von der IANA vergeben wird.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Arten</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><b>Stub-AS</b> sind mit <i>genau</i> einem anderen AS über eine direkte Leitung
verbunden. Sie können nur über diese Direktverbindung Daten mit dem
anderen AS und dem Rest des Internets austauschen
</li>
<li><b>Multihomed AS</b> sind mit mindestens zwei anderen AS über eine direkte
Leitung verbunden
</li>
<li><b>Transit-AS</b> sind mit mindestens zwei andere AS angebunden und
fungieren als Verbindung zwischen den angeschlossenen AS, d.h. sie
leiten Daten von den angeschlossenen AS an andere angeschlossene AS
weiter. Die Internet-Backbone-Netzwerke sind typische Beispiele für
Transit-AS.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Gründe für die Verwendung von AS</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><b>Administrative Autonomität</b>:
<ul class="org-ul">
<li>Routing Policies können individuell für jedes AS festgelegt werden
</li>
<li>Protokolle können individuell für jedes AS festgelegt werden
</li>
</ul>
</li>
<li><b>Skalierung</b>: AS ermöglichen weitere Aggregation von Routing
Information (d.h. kleine routing tabellen), da beim interdomain
routing nur gespeichert werden muss, zu welchem AS eine IP Adresse
gehört. Die Weiterleitung des IP-Pakets an den Host übernimmt dann
das AS. Bei einem flachem Netzwerk müsste jeder Router für jedes
IP-Netz einen Eintrag haben, der angibt, wohin ein IP-Paket zu
senden ist.
</li>
</ol>
</div>
</div>
